---
kind: property
id: P:Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.TransferMode
source: html/1e471493-fb1a-9c29-4e64-81e79d9440e4.htm
---
# Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.TransferMode Property

Data transfer mode in this event.

## Syntax (C#)
```csharp
public DataTransferMode TransferMode { get; }
```